#+TITLE: Beginning Programming in JavaScript
#+AUTHOR: Clarissa Littler

#+OPTIONS: toc:nil H:2
#+startup: beamer
#+BEAMER_THEME: Madrid
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [bigger]

* Closures
** Functions and Variables
  + Functions can return functions \pause
  + Variable scope and inner functions \pause
#+BEGIN_SRC js :exports code 
  function fun1 () {
      var inner = 0;
      return (function () { inner = inner+1;
                           return inner;
                           });
  }
  var f = fun1();
  f();
  f();
  console.log(f());
#+END_SRC

#+RESULTS:
: 3
: undefined
** The Use of Closures
   + Hidden state \pause
   + Data protection \pause
   + Counters
* =this= and That
** =this=
   + 
* Prototypes
  + 
* Where To Go From Here?
** Learning More Programming
   + Continuing Code Academy \pause
   + 
** Web Programming Track
   + jQuery \pause
   + Node \pause
   + Frameworks
** jQuery
   + 
** Node
   + nodeschool.io
